///* 2051891 黄治东 信管 */
//#include <iostream>
//using namespace std;
//
///***************************************************************************
//  函数名称：
//  功    能：输出位数、正序、逆序
//  输入参数：
//  返 回 值：
//  说    明：不准修改函数名、返回类型、形参
//***************************************************************************/
//void output(int k)
//{
//	static bool top = true;
//	static bool positive_sequence = true;
//	if (positive_sequence)
//	{
//		if (top == true)//正序输出
//		{
//			int temp = k;
//			int digit = 1;
//			for (; temp / 10 != 0; temp /= 10)
//			{
//				digit++;
//			}
//			cout << digit << "位数\n";
//			top = false;
//			cout << "每位数字分别是 : \n";
//			output(k / 10);
//			cout << k % 10 << endl;
//
//			//逆序输出
//			positive_sequence = false;
//			top = true;
//			output(k);
//			positive_sequence = true;
//			cout << endl;
//		}
//		else if (k / 10 != 0)
//		{
//			output(k / 10);
//			cout << k % 10 << " ";
//
//		}
//		else
//		{
//			cout << k % 10 << " ";
//		}
//	}
//	else
//	{
//		if (top == true)
//		{
//
//			top = false;
//			cout << "逆序输出的每位数字分别是 : \n";
//			cout << k % 10;
//			output(k / 10);
//
//		}
//		else if (k / 10 != 0)
//		{
//			cout << " " << k % 10;
//			output(k / 10);
//		}
//		else
//		{
//			cout << " " << k % 10;
//		}
//	}
//}
//
///***************************************************************************
//  函数名称：
//  功    能：重复输入，直到取得[0..99999]之间的整数后返回
//  输入参数：
//  返 回 值：
//  说    明：不准修改函数名、返回类型、形参
//***************************************************************************/
//int input(void)
//{
//	while (true)
//	{
//		cout << "请输入一个[0..99999]间的整数\n";
//		int temp;
//		int n;
//		cin >> n;
//		if (cin.good() == 0)
//		{
//			cin.clear();
//			while ((temp = getchar()) != '\n')
//			{
//				;
//			}
//			continue;
//		}
//		else if (n >= 0 && n <= 99999)
//		{
//			return n;
//		}
//		while ((temp = getchar()) != '\n')
//		{
//			;
//		}
//	}
//}
//
//
///***************************************************************************
//  函数名称：
//  功    能：
//  输入参数：
//  返 回 值：
//  说    明：main函数不准动
//***************************************************************************/
//int main()
//{
//	int k;
//
//	k = input();
//	output(k);
//
//	return 0;
//}
